# Brewfile - Declarative Homebrew dependencies
# Install with: brew bundle
# Update with: ./sync-brewfile.sh

# Core tools
brew "bat"
brew "cmake"
brew "coreutils"
brew "fzf"
brew "git"
brew "make"
brew "neovim"
brew "ripgrep"
brew "tmux"
brew "tree"
brew "uv"
brew "wget"

# Third-party taps
tap "coursier/formulas"

# Dev languages & runtimes
brew "coursier/formulas/coursier"
brew "go"
brew "node"
brew "pnpm"
brew "rustup"

# Git tools
brew "bfg"
brew "gh"
brew "git-filter-repo"
brew "git-lfs"

# Container & supply-chain tools
brew "cosign"
brew "crane"
brew "dive"
brew "docker-compose"
brew "grype"
brew "ollama"
brew "oras"
brew "skopeo"
brew "trivy"
brew "zizmor"

# LSP servers & formatters
brew "lua-language-server"
brew "shellcheck"
brew "stylua"
brew "tree-sitter"

# Utilities
brew "btop"
brew "difftastic"
brew "dust"
brew "ffmpeg"
brew "glow"
brew "hexedit"
brew "hugo"
brew "jless"
brew "jq"
brew "ncdu"
brew "procs"

# Casks (GUI applications, fonts, and CLI tools)
cask "claude-code"
cask "bruno"
cask "docker-desktop"
cask "font-fira-code-nerd-font"
cask "ghostty"
cask "gimp"
cask "rectangle"
